Autodesk.Revit.DB.TextBaselineStyle
Since:
2016
Supported styles of text position relative to the normal baseline.
Since:
2016

Autodesk.Revit.DB.TextBaselineStyle.Superscript
Indicates a superscript text.

Autodesk.Revit.DB.TextBaselineStyle.Subscript
Indicates a subsript text.

Autodesk.Revit.DB.TextBaselineStyle.Normal
Indicates a normal text with letters positioned on the baseline.